wintersmith/contents/articles/Perl/2013-02-16-Alien.html
---
date: 2013-02-16
template: tech.jade
title: Perl Alien 介绍
category: Perl
change_frequency: monthly
tag: Alien
---
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">Alien是什么</a></li>
<li><a href="#sec-2">Alien的目标</a></li>
<li><a href="#sec-3">Alien模块的约定/保证</a></li>
<li><a href="#sec-4">编写Alien模块</a></li>
<li><a href="#sec-5">实例</a></li>
</ul>
</div>
</div>
<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1">Alien是什么</h2>
<div class="outline-text-2" id="text-1">
<p>
本文介绍Perl中的Alien。
</p>

<p>
Alien 是一个名字空间或者一系列Module/Perl package。
</p>

<p>
Alien的目标是对C库进行封装，封装成Perl模块的形式，方便安装和使用。
</p>

<p>
如<a href="http://search.cpan.org/perldoc?Alien::OpenSSL">Alien::NSS</a> 是OpenSSL库的Alien封装。我们可以在其CPAN页面上看到使用说明。
</p>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2">Alien的目标</h2>
<div class="outline-text-2" id="text-2">
<p>
Alien的目标是确保某个库已经安装。
</p>

<p>
如Alien::NSS库的目标是确保OpenSSL的库已经安装，如果我们的Perl模块依赖OpenSSL的C库，我们可以在Build.PL中添加对Alien::NSS的依赖，从而确保安装
模块的时候，OpenSSL库已经安装。
</p>
</div>
</div>

<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3">Alien模块的约定/保证</h2>
<div class="outline-text-2" id="text-3">
<ol class="org-ol">
<li>安装时候确保依赖的包已经安装，如果未安装则安装他们。
</li>
<li>使用Alien模块的时候，确保需要的包存在，否则报错给调用者。
</li>
<li>将C库的源码和模块打包绑定发布，或者在安装的时候下载。
</li>
<li>允许模块作者访问Alien模块获取的信息。
</li>
<li>良好的文档保证容易正确使用。
</li>
<li>容易地使用Module::Build。
</li>
</ol>
</div>
</div>

<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4">编写Alien模块</h2>
<div class="outline-text-2" id="text-4">
<ol class="org-ol">
<li>继承Alien::Base , use parent Alien::Base;
</li>
<li>编写Build.PL, 继承Alien::Base::ModuleBuild, 根据Alien::Base::ModuleBuild 配置，构建其实例，然后调用create_build_script方法。
</li>
</ol>
<p>
【参见：Alien::NSS等模块的Build.PL文件。】
</p>
</div>
</div>

<div id="outline-container-sec-5" class="outline-2">
<h2 id="sec-5">实例</h2>
<div class="outline-text-2" id="text-5">
<p>
下面以<a href="http://search.cpan.org/perldoc?Alien::Tidyp">Alien::Tidyp</a> 为例来看,结合<a href="http://search.cpan.org/perldoc?HTML::Tidy">HTML::Tidy </a>模块对其的使用来看Alien模块的作用和使用方式：
</p>
<ul class="org-ul">
<li>HTML::Tidy模块的 <a href="http://cpansearch.perl.org/src/PETDANCE/HTML-Tidy-1.54/Makefile.PL">Makefile.PL</a> 文件中有如下内容：
<div class="org-src-container">

<pre class="src src-perl">eval { require Alien::Tidyp; };

if ( !$@ ) {
    print "Using tidyp via Alien::Tidyp\n";
    $libs = Alien::Tidyp-&gt;config('LIBS');
    $inc = Alien::Tidyp-&gt;config('INC');
}
</pre>
</div>
<p>
从中可以发现HTML::Tidy模块在编译、build的时候回依赖Tidyp这个C库，而它是通过Alien::Tidyp这个模块来间接获取tidyp这个库的一些配置信息（动态连接库的位置LIBS和头文件的位置INC）。<br  />
  从这里我们可以发现Alien的用途：帮助其它模块找到相关库的配置信息。是一个helper类型的模块。
</p>
</li>
<li>Alien::Tidyp的 <a href="http://cpansearch.perl.org/src/KMX/Alien-Tidyp-v1.4.7/Build.PL">Build.PL</a> 文件有如下内容：
<div class="org-src-container">

<pre class="src src-perl"># set what tidyp tarball we are gonna use
$builder-&gt;notes('tidyp_url', [
    'http://github.com/downloads/petdance/tidyp/tidyp-1.04.tar.gz',
    'https://github.com/downloads/petdance/tidyp/tidyp-1.04.tar.gz',
    'http://strawberryperl.com/package/kmx/testing/tidyp-1.04.tar.gz',
  ]); # has to be an array
$builder-&gt;notes('tidyp_dir', 'tidyp-1.04'); # dirname inside the tarball
$builder-&gt;notes('tidyp_sha1', '5d9050512259c3a67a2f48469555932e3a7b8bd0');
</pre>
</div>
<p>
从这里和Alien::Tidyp的文档，我们大致可以知道，Alien::Tidyp在安装自身的时候做了什么：
</p>
<ul class="org-ul">
<li>探测tidyp的位置，包括头文件和二进制库的位置，存储在Alien::Tidyp::ConfigData模块中（此模块在AlienTidyp安装后生成）
</li>
<li>如果没有安装则进行从source code的构建，从上面代码片段可以发现其使用的代码位置，然后将信息记录在Alien::Tidyp::ConfigData模块中
</li>
</ul>
<p>
最终，Alien::Tidyp安装完成后，我们就可以从其模块中得到tidyp这个库的一些配置信息。这也就是Alien模块的作用：获取库的配置信息（如果没有则安装它们）。
</p>
</li>
</ul>
</div>
</div>
